STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.h
/**
  ******************************************************************************
  * @file    stm32u5xx_hal_tamp.h
  * @brief   Header file of TAMP HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U5XX_HAL_TAMP_H
#define STM32U5XX_HAL_TAMP_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal_def.h"
#include "stm32u5xx_ll_tamp.h"


/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @defgroup TAMP TAMP
  * @{
  */

/* Exported enumerations --------------------------------------------------------*/
/** @defgroup TAMP_Exported_Enums TAMP exported enumerations
  * @{
  */

/** @defgroup TAMP_Exported_Enums_Passive TAMP exported passive tamper enumerations
  * @{
  */

/**
  * @brief Passive tampers detection of edge level definition.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_TRIGGER_RISING  = LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL, /*!< Rising edge triggers a tamper detection  */
  HAL_TAMP_PASSIVE_TRIGGER_FALLING = LL_TAMP_ACTIVELEVEL_TAMP,           /*!< Falling edge triggers a tamper detection */
  HAL_TAMP_PASSIVE_TRIGGER_LOW     = LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL, /*!< Low level triggers a tamper detection */
  HAL_TAMP_PASSIVE_TRIGGER_HIGH    = LL_TAMP_ACTIVELEVEL_TAMP,           /*!< High level triggers a tamper detection */
} hal_tamp_passive_trigger_t;

/**
  * @brief Passive tampers erase mode definitions.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_SECRETS_ERASE    = LL_TAMP_ERASE_ACTIVATE_ALL, /*!< Tampers are in confirmed mode: device secrets
                                                                  are erased when a tamper is detected */
  HAL_TAMP_PASSIVE_SECRETS_NO_ERASE = LL_TAMP_NOERASE_TAMPER      /*!< Tampers are in potential mode: some device
                                                                   secrets are not erased when a tamper is detected */
} hal_tamp_passive_secrets_erase_t;


/**
  * @brief Passive tampers masked definition.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_UNMASKED = LL_TAMP_MASK_NONE,  /*!< Tampers are not masked and behave as expected */
  HAL_TAMP_PASSIVE_MASKED   = LL_TAMP_MASK_TAMPER /*!< Tampers are masked: a tamper detection does not trigger */
} hal_tamp_passive_mask_t;

/**
  * @brief Passive tampers pull-up (precharge) definition.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_DISABLE = LL_TAMP_PULL_UP_DISABLE, /*!< Disable tamper pull-up (precharge) */
  HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_ENABLE  = LL_TAMP_PULL_UP_ENABLE,  /*!< Enable tamper pull-up (precharge) */
} hal_tamp_passive_pull_up_precharge_state_t;

/**
  * @brief Passive tampers pull-up precharge duration definition.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_1_RTCCLK = LL_TAMP_DURATION_1RTCCLK, /*!< Tamper pins are precharged before
                                                                              sampling during one RTCCLK cycle*/
  HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_2_RTCCLK = LL_TAMP_DURATION_2RTCCLK, /*!< Tamper pins are precharged before
                                                                               sampling during two RTCCLK cycle */
  HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_4_RTCCLK = LL_TAMP_DURATION_4RTCCLK, /*!< Tamper pins are precharged before
                                                                               sampling during four RTCCLK cycle */
  HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_8_RTCCLK = LL_TAMP_DURATION_8RTCCLK  /*!< Tamper pins are precharged before
                                                                              sampling during eight RTCCLK cycle */
} hal_tamp_passive_pull_up_precharge_duration_t;

/**
  * @brief Passive tampers filter activation definition.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_FILTER_DISABLE   = LL_TAMP_FILTER_DISABLE,  /*!< Tamper filter is disabled */
  HAL_TAMP_PASSIVE_FILTER_2_SAMPLES = LL_TAMP_FILTER_2SAMPLES, /*!< Tamper is activated after two consecutive
                                                                   samples at the active level */
  HAL_TAMP_PASSIVE_FILTER_4_SAMPLES = LL_TAMP_FILTER_4SAMPLES, /*!< Tamper is activated after four consecutive
                                                                   samples at the active level */
  HAL_TAMP_PASSIVE_FILTER_8_SAMPLES = LL_TAMP_FILTER_8SAMPLES  /*!< Tamper is activated after eight consecutive
                                                                   samples at the active level */
} hal_tamp_passive_filter_t;

/**
  * @brief Passive tampers sampling frequency definitions.
  */
typedef enum
{
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_256   = LL_TAMP_SAMPLFREQDIV_256,   /*!< Each of the tampers inputs are sampled
                                                                        with a frequency =  RTCCLK / 256 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_512   = LL_TAMP_SAMPLFREQDIV_512,   /*!< Each of the tampers inputs are sampled
                                                                        with a frequency =  RTCCLK / 512 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_1024  = LL_TAMP_SAMPLFREQDIV_1024,  /*!< Each of the tampers inputs are sampled
                                                                          with a frequency =  RTCCLK / 1024 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_2048  = LL_TAMP_SAMPLFREQDIV_2048,  /*!< Each of the tampers inputs are sampled
                                                                          with a frequency =  RTCCLK / 2048 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_4096  = LL_TAMP_SAMPLFREQDIV_4096,  /*!< Each of the tampers inputs are sampled
                                                                          with a frequency =  RTCCLK / 4096 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_8192  = LL_TAMP_SAMPLFREQDIV_8192,  /*!< Each of the tampers inputs are sampled
                                                                          with a frequency =  RTCCLK / 8192 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_16384 = LL_TAMP_SAMPLFREQDIV_16384, /*!< Each of the tampers inputs are sampled
                                                                            with a frequency =  RTCCLK / 16384 */
  HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_32768 = LL_TAMP_SAMPLFREQDIV_32768, /*!< Each of the tampers inputs are sampled
                                                                            with a frequency =  RTCCLK / 32768 */
} hal_tamp_passive_sample_frequency_t;

/**
  * @}
  */

/** @defgroup TAMP_Exported_Enums_Internal TAMP exported internal tampers enumerations
  * @{
  */

/**
  * @brief Internal tampers erase mode definitions.
  */
typedef enum
{
  HAL_TAMP_INTERNAL_SECRETS_ERASE    = LL_TAMP_ITAMP_ERASE_ACTIVE_ALL, /*!< Tampers are in confirmed mode: device
                                                                         secrets are erased when a tamper is detected */
  HAL_TAMP_INTERNAL_SECRETS_NO_ERASE = LL_TAMP_ITAMP_NOERASE_TAMPER    /*!< Tampers are in potential mode: some device
                                                                          secrets are not erased when
                                                                          a tamper is detected */
} hal_tamp_internal_secrets_erase_t;

/**
  * @}
  */

/** @defgroup TAMP_Exported_Enums_Active TAMP exported active tampers enumerations
  * @{
  */

/**
  * @brief Active tampers filter definitions.
  */
typedef enum
{
  HAL_TAMP_ACTIVE_FILTER_DISABLE = LL_TAMP_ATAMP_FILTERING_DISABLE,  /*!< Active filter is disable */
  HAL_TAMP_ACTIVE_FILTER_ENABLE  = LL_TAMP_ATAMP_FILTERING_ENABLE,   /*!< Active filter is enable, a tamper event is
                                                                         detected when 2 comparison mismatches occur
                                                                         out of 4 consecutive samples.*/
} hal_tamp_active_filter_state_t;

/**
  * @brief Active tampers asynchronous prescaler clock selection definitions.
  */
typedef enum
{
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK         = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK,       /*!< The clock is set to
                                                                                       RTCCLK */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_2   = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_2,     /*!< The clock is set to
                                                                                       RTCCLK/2 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_4   = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_4,     /*!< The clock is set to
                                                                                       RTCCLK/4 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_8   = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_8,     /*!< The clock is set to
                                                                                       RTCCLK/8 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_16  = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_16,    /*!< The clock is set to
                                                                                       RTCCLK/16 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_32  = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_32,    /*!< The clock is set to
                                                                                       RTCCLK/32 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_64  = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_64,    /*!< The clock is set to
                                                                                       RTCCLK/64 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_128 = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_128,   /*!< The clock is set to
                                                                                       RTCCLK/128 */
  HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_2048 = LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_2048 /*!< The clock is set to
                                                                                       RTCCLK/2048 */
} hal_tamp_active_prescaler_t;

/**
  * @brief Active tamper erase mode definitions.
  */
typedef enum
{
  HAL_TAMP_ACTIVE_SECRETS_ERASE    = LL_TAMP_ERASE_ACTIVATE_ALL, /*!< Active tampers are in confirmed mode: \
                                                                   device secrets are erased when \
                                                                   a tamper is detected */
  HAL_TAMP_ACTIVE_SECRETS_NO_ERASE = LL_TAMP_NOERASE_TAMPER      /*!< Active tampers are in potential mode: \
                                                                   device secrets are not erased when \
                                                                   a tamper is detected */
} hal_tamp_active_secrets_erase_t;


/**
  * @brief Active tamper output shared definitions.
  */
typedef enum
{
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_NOT_SHARED = LL_TAMP_ATAMP_SHARING_DISABLE,     /*!< Active tampers \
                                                                                 outputs are not shared */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_SHARED     = LL_TAMP_ATAMP_SHARING_ENABLE       /*!< Active tampers \
                                                                                 outputs are shared*/
} hal_tamp_active_output_shared_t;

/**
  * @brief Output tampers definitions.
  */
typedef enum
{
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_1 = LL_TAMP_ATAMP1IN_ATAMP1OUT, /*!< Active tamper output 1 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_2 = LL_TAMP_ATAMP1IN_ATAMP2OUT, /*!< Active tamper output 2 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_3 = LL_TAMP_ATAMP1IN_ATAMP3OUT, /*!< Active tamper output 3 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_4 = LL_TAMP_ATAMP1IN_ATAMP4OUT, /*!< Active tamper output 4 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_5 = LL_TAMP_ATAMP1IN_ATAMP5OUT, /*!< Active tamper output 5 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_6 = LL_TAMP_ATAMP1IN_ATAMP6OUT, /*!< Active tamper output 6 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_7 = LL_TAMP_ATAMP1IN_ATAMP7OUT, /*!< Active tamper output 7 */
  HAL_TAMP_ACTIVE_TAMPER_OUTPUT_8 = LL_TAMP_ATAMP1IN_ATAMP8OUT  /*!< Active tamper output 8 */
} hal_tamp_active_output_tampers_t;
/**
  * @}
  */

/** @defgroup TAMP_Exported_Enums_Monotonic_Counters TAMP exported monotonic counters enumerations
  * @{
  */

/**
  * @brief Monotonic counter definitions.
  */
typedef enum
{
  HAL_TAMP_MONOTONIC_1 = 0U, /*!< Monotonic counter number 1 */
} hal_tamp_monotonic_counter_t;

/**
  * @}
  */

