STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.h
/** @defgroup TAMP_Exported_Enums_Device_Secrets TAMP exported secrets enumerations
  * @{
  */

/**
  * @brief Device secrets access status definitions.
  */
typedef enum
{
  HAL_TAMP_SECRETS_ACCESS_UNBLOCKED = 0U, /*!< Device secrets can be accessed if no tamper flag is set. */
  HAL_TAMP_SECRETS_ACCESS_BLOCKED   = 1U  /*!< Device secrets cannot be accessed.*/
} hal_tamp_secrets_status_t;

/**
  * @brief Resource protection status definitions.
  */
typedef enum
{
  HAL_TAMP_PROTECT_RESOURCES_DISABLED = 0U, /*!< Resources protection is disabled. */
  HAL_TAMP_PROTECT_RESOURCES_ENABLED  = 1U  /*!< Resources protections is enabled. */
} hal_tamp_protect_resources_status_t;
/**
  * @}
  */

/** @defgroup TAMP_Exported_Enums_BHK TAMP exported hardware boot key enumerations
  * @{
  */

/**
  * @brief Hardware boot key lock status definitions.
  */
typedef enum
{
  HAL_TAMP_HW_BOOTKEY_ACCESS_UNBLOCKED = 0U, /*!< The eight first backup registers can be accessed. */
  HAL_TAMP_HW_BOOTKEY_ACCESS_BLOCKED   = 1U  /*!< The eight first backup registers cannot be accessed. */
} hal_tamp_hardware_bootkey_status_t;
/**
  * @}
  */

/**
  * @}
  */


/* Exported Unions ----------------------------------------------------------*/

/* Exported defines ----------------------------------------------------------*/

/** @defgroup TAMP_Exported_Defines TAMP exported defines
  * @{
  */

/** @defgroup TAMP_Exported_Defines_Tamper_OUTPUT_PERIOD TAMP tamper defines.
  * @{
  */
#define HAL_TAMP_OUTPUT_PERIOD   LL_TAMP_OUTPUT_PERIOD  /*!< Active tamper output period. */
/**
  * @}
  */

/** @defgroup TAMP_Exported_Defines_Tamper TAMP tamper defines for passive and active.
  * @{
  */
#define HAL_TAMP_TAMPER_1    LL_TAMP_1   /*!< Tamper input 1 */
#define HAL_TAMP_TAMPER_2    LL_TAMP_2   /*!< Tamper input 2 */
#define HAL_TAMP_TAMPER_3    LL_TAMP_3   /*!< Tamper input 3 */
#define HAL_TAMP_TAMPER_4    LL_TAMP_4   /*!< Tamper input 4 */
#define HAL_TAMP_TAMPER_5    LL_TAMP_5   /*!< Tamper input 5 */
#define HAL_TAMP_TAMPER_6    LL_TAMP_6   /*!< Tamper input 6 */
#define HAL_TAMP_TAMPER_7    LL_TAMP_7   /*!< Tamper input 7 */
#define HAL_TAMP_TAMPER_8    LL_TAMP_8   /*!< Tamper input 8 */
#define HAL_TAMP_TAMPER_ALL  LL_TAMP_ALL /*!< All tampers inputs */
/**
  * @}
  */

/** @defgroup TAMP_Exported_Defines_Internal_Tamper TAMP internal tamper defines.
  * @{
  */
#define HAL_TAMP_INTERNAL_TAMPER_1   LL_TAMP_ITAMP1    /*!< Internal tamper input 1 */
#define HAL_TAMP_INTERNAL_TAMPER_2   LL_TAMP_ITAMP2    /*!< Internal tamper input 2 */
#define HAL_TAMP_INTERNAL_TAMPER_3   LL_TAMP_ITAMP3    /*!< Internal tamper input 3 */
#define HAL_TAMP_INTERNAL_TAMPER_5   LL_TAMP_ITAMP5    /*!< Internal tamper input 5 */
#define HAL_TAMP_INTERNAL_TAMPER_6   LL_TAMP_ITAMP6    /*!< Internal tamper input 6 */
#define HAL_TAMP_INTERNAL_TAMPER_7   LL_TAMP_ITAMP7    /*!< Internal tamper input 7 */
#define HAL_TAMP_INTERNAL_TAMPER_8   LL_TAMP_ITAMP8    /*!< Internal tamper input 8 */
#define HAL_TAMP_INTERNAL_TAMPER_9   LL_TAMP_ITAMP9    /*!< Internal tamper input 9 */
#define HAL_TAMP_INTERNAL_TAMPER_11  LL_TAMP_ITAMP11   /*!< Internal tamper input 11 */
#define HAL_TAMP_INTERNAL_TAMPER_12  LL_TAMP_ITAMP12   /*!< Internal tamper input 12 */
#define HAL_TAMP_INTERNAL_TAMPER_13  LL_TAMP_ITAMP13   /*!< Internal tamper input 13 */
#define HAL_TAMP_INTERNAL_ALL        LL_TAMP_ITAMP_ALL /*!< All internal tampers inputs */
/**
  * @}
  */

/** @defgroup TAMP_Exported_Defines_Resources TAMP resources defines
  * @{
  */
#define HAL_TAMP_BACKUP_SRAM      LL_TAMP_RESOURCE_0      /*!< Backup SRAM */
#define HAL_TAMP_RESOURCES_ALL    LL_TAMP_RESOURCES_ALL
/**
  * @}
  */

/** @defgroup TAMP_Exported_Defines_Tamper_Interruption TAMP tamper interruption defines
  * @{
  */
#define HAL_TAMP_IT_NONE       LL_TAMP_IT_NONE       /*!< All external tampers interruptions are disabled */
#define HAL_TAMP_IT_TAMPER_1   LL_TAMP_IT_TAMPER_1   /*!< External tamper 1 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_2   LL_TAMP_IT_TAMPER_2   /*!< External tamper 2 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_3   LL_TAMP_IT_TAMPER_3   /*!< External tamper 3 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_4   LL_TAMP_IT_TAMPER_4   /*!< External tamper 4 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_5   LL_TAMP_IT_TAMPER_5   /*!< External tamper 5 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_6   LL_TAMP_IT_TAMPER_6   /*!< External tamper 6 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_7   LL_TAMP_IT_TAMPER_7   /*!< External tamper 7 interruption is enabled */
#define HAL_TAMP_IT_TAMPER_8   LL_TAMP_IT_TAMPER_8   /*!< External tamper 8 interruption is enabled */
#define HAL_TAMP_IT_ALL        LL_TAMP_IT_ALL        /*!< All external tampers interruptions are enabled */
/**
  * @}
  */

/** @defgroup TAMP_Exported_Defines_Internal_Tamper_Interruption TAMP internal tamper interruption defines
  * @{
  */
#define HAL_TAMP_INTERNAL_IT_NONE       LL_TAMP_INTERNAL_IT_NONE       /*!< All internal tampers interruptions are disabled */
#define HAL_TAMP_INTERNAL_IT_TAMPER_1   LL_TAMP_INTERNAL_IT_TAMPER_1  /*!< Internal tamper 1 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_2   LL_TAMP_INTERNAL_IT_TAMPER_2  /*!< Internal tamper 2 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_3   LL_TAMP_INTERNAL_IT_TAMPER_3  /*!< Internal tamper 3 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_5   LL_TAMP_INTERNAL_IT_TAMPER_5  /*!< Internal tamper 5 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_6   LL_TAMP_INTERNAL_IT_TAMPER_6  /*!< Internal tamper 6 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_7   LL_TAMP_INTERNAL_IT_TAMPER_7  /*!< Internal tamper 7 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_8   LL_TAMP_INTERNAL_IT_TAMPER_8  /*!< Internal tamper 8 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_9   LL_TAMP_INTERNAL_IT_TAMPER_9  /*!< Internal tamper 9 interruption is enabled  */
#define HAL_TAMP_INTERNAL_IT_TAMPER_11  LL_TAMP_INTERNAL_IT_TAMPER_11 /*!< Internal tamper 11 interruption is enabled */
#define HAL_TAMP_INTERNAL_IT_TAMPER_12  LL_TAMP_INTERNAL_IT_TAMPER_12 /*!< Internal tamper 12 interruption is enabled */
#define HAL_TAMP_INTERNAL_IT_TAMPER_13  LL_TAMP_INTERNAL_IT_TAMPER_13 /*!< Internal tamper 13 interruption is enabled */
#define HAL_TAMP_INTERNAL_IT_ALL        LL_TAMP_INTERNAL_IT_ALL        /*!< All internal tampers interruptions are enabled */
/**
  * @}
  */


/**
  * @}
  */


/* Exported structures --------------------------------------------------------*/

/** @defgroup TAMP_Exported_Structures TAMP Exported structures
  * @{
  */

/** @defgroup TAMP_Exported_Structures_Passive TAMP passive tampers exported structures
  * @{
  */

/**
  * @brief Passive tamper configuration.
  */
typedef struct
{
  hal_tamp_passive_pull_up_precharge_state_t precharge; /*!< Specifies the activation of the pull-up (precharge).*/
  hal_tamp_passive_pull_up_precharge_duration_t precharge_duration; /*!< Specifies the duration of \
                                                                        the precharge in RTCCLK units. */
  hal_tamp_passive_filter_t type_activation; /*!< Specifies the activation type of the tamper.*/
  hal_tamp_passive_sample_frequency_t sample_frequency; /*!< Specifies the tamper sample frequency.*/
} hal_tamp_passive_config_t;

/**
  * @brief Passive tamper individual configuration.
  */
typedef struct
{
  hal_tamp_passive_trigger_t trigger; /*!< Specifies the trigger type for edge and \
                                                        level tamper detection. */
  hal_tamp_passive_secrets_erase_t erase_secrets; /*!< Specifies the tamper erase mode. */
  hal_tamp_passive_mask_t masked; /*!< Specifies that the tamper is masked or not.*/

