STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.h
} hal_tamp_passive_individual_config_t;

/**
  * @}
  */

/** @defgroup TAMP_Exported_Structures_Internal TAMP internal tampers exported structures
  * @{
  */

/**
  * @brief Internal tamper individual configuration.
  */
typedef struct
{
  hal_tamp_internal_secrets_erase_t erase_secrets; /*!< Specifies the internal tamper erase mode.*/
} hal_tamp_internal_individual_config_t;

/**
  * @}
  */

/** @defgroup TAMP_Exported_Structures_Active TAMP active tampers exported structures
  * @{
  */

/**
  * @brief Active tamper configuration.
  */
typedef struct
{
  uint32_t output_period; /*!< Specifies the period when the output signals changes. */
  hal_tamp_active_filter_state_t filter; /*!< Specifies the active tamper filter activation. */
  hal_tamp_active_prescaler_t asynchronous_prescaler; /*!< Specifies the asynchronous prescaler clock selection. */
  hal_tamp_active_output_shared_t shared_output; /*!< Specifies that tampers outputs and inputs are shared.*/
}  hal_tamp_active_config_t;

/**
  * @brief Active tamper individual configuration.
  */
typedef struct
{
  hal_tamp_active_secrets_erase_t erase_secrets; /*!< Specifies the active tamper erase mode.*/
  hal_tamp_active_output_tampers_t tamper_output; /*!< Specifies the output tampers used.*/
} hal_tamp_active_individual_config_t;

/**
  * @}
  */

/**
  * @brief Backup registers enumeration definition
  */
typedef enum
{
  HAL_TAMP_BACKUP_REG_0 = LL_TAMP_BKP_DR0, /*!< TAMP Backup register 0 */
  HAL_TAMP_BACKUP_REG_1 = LL_TAMP_BKP_DR1, /*!< TAMP Backup register 1 */
  HAL_TAMP_BACKUP_REG_2 = LL_TAMP_BKP_DR2, /*!< TAMP Backup register 2 */
  HAL_TAMP_BACKUP_REG_3 = LL_TAMP_BKP_DR3, /*!< TAMP Backup register 3 */
  HAL_TAMP_BACKUP_REG_4 = LL_TAMP_BKP_DR4, /*!< TAMP Backup register 4 */
  HAL_TAMP_BACKUP_REG_5 = LL_TAMP_BKP_DR5, /*!< TAMP Backup register 5 */
  HAL_TAMP_BACKUP_REG_6 = LL_TAMP_BKP_DR6, /*!< TAMP Backup register 6 */
  HAL_TAMP_BACKUP_REG_7 = LL_TAMP_BKP_DR7, /*!< TAMP Backup register 7 */
  HAL_TAMP_BACKUP_REG_8 = LL_TAMP_BKP_DR8, /*!< TAMP Backup register 8  */
  HAL_TAMP_BACKUP_REG_9 = LL_TAMP_BKP_DR9, /*!< TAMP Backup register 9  */
  HAL_TAMP_BACKUP_REG_10 = LL_TAMP_BKP_DR10, /*!< TAMP Backup register 10 */
  HAL_TAMP_BACKUP_REG_11 = LL_TAMP_BKP_DR11, /*!< TAMP Backup register 11 */
  HAL_TAMP_BACKUP_REG_12 = LL_TAMP_BKP_DR12, /*!< TAMP Backup register 12 */
  HAL_TAMP_BACKUP_REG_13 = LL_TAMP_BKP_DR13, /*!< TAMP Backup register 13 */
  HAL_TAMP_BACKUP_REG_14 = LL_TAMP_BKP_DR14, /*!< TAMP Backup register 14 */
  HAL_TAMP_BACKUP_REG_15 = LL_TAMP_BKP_DR15, /*!< TAMP Backup register 15 */
  HAL_TAMP_BACKUP_REG_16 = LL_TAMP_BKP_DR16, /*!< TAMP Backup register 16 */
  HAL_TAMP_BACKUP_REG_17 = LL_TAMP_BKP_DR17, /*!< TAMP Backup register 17 */
  HAL_TAMP_BACKUP_REG_18 = LL_TAMP_BKP_DR18, /*!< TAMP Backup register 18 */
  HAL_TAMP_BACKUP_REG_19 = LL_TAMP_BKP_DR19, /*!< TAMP Backup register 19 */
  HAL_TAMP_BACKUP_REG_20 = LL_TAMP_BKP_DR20, /*!< TAMP Backup register 20 */
  HAL_TAMP_BACKUP_REG_21 = LL_TAMP_BKP_DR21, /*!< TAMP Backup register 21 */
  HAL_TAMP_BACKUP_REG_22 = LL_TAMP_BKP_DR22, /*!< TAMP Backup register 22 */
  HAL_TAMP_BACKUP_REG_23 = LL_TAMP_BKP_DR23, /*!< TAMP Backup register 23 */
  HAL_TAMP_BACKUP_REG_24 = LL_TAMP_BKP_DR24, /*!< TAMP Backup register 24 */
  HAL_TAMP_BACKUP_REG_25 = LL_TAMP_BKP_DR25, /*!< TAMP Backup register 25 */
  HAL_TAMP_BACKUP_REG_26 = LL_TAMP_BKP_DR26, /*!< TAMP Backup register 26 */
  HAL_TAMP_BACKUP_REG_27 = LL_TAMP_BKP_DR27, /*!< TAMP Backup register 27 */
  HAL_TAMP_BACKUP_REG_28 = LL_TAMP_BKP_DR28, /*!< TAMP Backup register 28 */
  HAL_TAMP_BACKUP_REG_29 = LL_TAMP_BKP_DR29, /*!< TAMP Backup register 29 */
  HAL_TAMP_BACKUP_REG_30 = LL_TAMP_BKP_DR30, /*!< TAMP Backup register 30 */
  HAL_TAMP_BACKUP_REG_31 = LL_TAMP_BKP_DR31, /*!< TAMP Backup register 31 */
} hal_tamp_backup_register_idx_t;

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup TAMP_Exported_Functions TAMP Exported Functions
  * @{
  */

/** @defgroup TAMP_Exported_Functions_Passive TAMP exported passive tamper mode functions
  * @{
  */

hal_status_t HAL_TAMP_PASSIVE_SetConfig(const hal_tamp_passive_config_t *p_config);
void HAL_TAMP_PASSIVE_GetConfig(hal_tamp_passive_config_t *p_config);

hal_status_t HAL_TAMP_PASSIVE_SetConfigTampers(uint32_t tampers, const hal_tamp_passive_individual_config_t *p_config);
void HAL_TAMP_PASSIVE_GetConfigTamper(uint32_t tamper, hal_tamp_passive_individual_config_t *p_config);

hal_status_t HAL_TAMP_PASSIVE_Start(uint32_t tampers, uint32_t interruption);
hal_status_t HAL_TAMP_PASSIVE_Stop(uint32_t tampers);

hal_status_t HAL_TAMP_PASSIVE_PollForEvent(uint32_t tampers, uint32_t timeout_ms);

/**
  * @}
  */

/** @defgroup TAMP_Exported_Functions_Internal TAMP exported internal tamper mode functions
  * @{
  */

hal_status_t HAL_TAMP_INTERNAL_SetConfigTampers(uint32_t internal_tampers,
                                                const hal_tamp_internal_individual_config_t *p_config);
void HAL_TAMP_INTERNAL_GetConfigTamper(uint32_t internal_tamper, hal_tamp_internal_individual_config_t *p_config);

hal_status_t HAL_TAMP_INTERNAL_Start(uint32_t internal_tampers, uint32_t interruption);
hal_status_t HAL_TAMP_INTERNAL_Stop(uint32_t internal_tampers);

hal_status_t HAL_TAMP_INTERNAL_PollForEvent(uint32_t internal_tampers, uint32_t timeout_ms);

/**
  * @}
  */

/** @defgroup TAMP_Exported_Functions_Active exported active tamper mode functions
  * @{
  */

hal_status_t HAL_TAMP_ACTIVE_SetConfig(const hal_tamp_active_config_t *p_config);
void HAL_TAMP_ACTIVE_GetConfig(hal_tamp_active_config_t *p_config);

hal_status_t HAL_TAMP_ACTIVE_SetConfigTampers(uint32_t tampers_input,
                                              const hal_tamp_active_individual_config_t *p_config);
void HAL_TAMP_ACTIVE_GetConfigTamper(uint32_t tamper_input,
                                     hal_tamp_active_individual_config_t *p_config);

hal_status_t HAL_TAMP_ACTIVE_Start(uint32_t tampers, uint32_t interruption, const uint32_t *p_seeds);
hal_status_t HAL_TAMP_ACTIVE_Stop(uint32_t tampers);

hal_status_t HAL_TAMP_ACTIVE_SetSeed(const uint32_t *p_seeds);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
hal_status_t  HAL_TAMP_ACTIVE_GetPRNG(uint32_t *p_prng);
#endif /* __ARM_FEATURE_CMSE */

hal_status_t HAL_TAMP_ACTIVE_PollForEvent(uint32_t tampers, uint32_t timeout_ms);

/**
  * @}
  */

/** @defgroup TAMP_Exported_Functions_IRQ TAMP exported IRQ functions
  * @{
  */

