STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.h
void HAL_TAMP_IRQHandler(void);
void HAL_TAMP_InternalTamperIRQHandler(void);
void HAL_TAMP_TamperIRQHandler(void);

/**
  * @}
  */

/** @defgroup TAMP_Exported_Functions_Callback TAMP exported callback functions
  * @{
  */

void HAL_TAMP_InternalTamperEventCallback(uint32_t internal_tampers);
void HAL_TAMP_TamperEventCallback(uint32_t tampers);

/**
  * @}
  */

/** @defgroup TAMP_Exported_Functions_Monotonic_Counters TAMP exported monotonic counter functions
  * @{
  */
hal_status_t HAL_TAMP_MONOTONIC_IncrementCounter(hal_tamp_monotonic_counter_t index);
uint32_t HAL_TAMP_MONOTONIC_GetCounter(hal_tamp_monotonic_counter_t index);
/**
  * @}
  */

/** @defgroup TAMP_Exported_Functions_Device_Secrets TAMP exported device secrets functions
  * @{
  */

hal_status_t HAL_TAMP_WriteBackupRegisterValue(hal_tamp_backup_register_idx_t backup_register_index,
                                               uint32_t data_32bit);
uint32_t HAL_TAMP_ReadBackupRegisterValue(hal_tamp_backup_register_idx_t backup_register_index);

hal_status_t HAL_TAMP_UnblockDeviceSecretsAccess(void);
hal_status_t HAL_TAMP_BlockDeviceSecretsAccess(void);
hal_tamp_secrets_status_t HAL_TAMP_IsBlockedDeviceSecretsAccess(void);
hal_status_t HAL_TAMP_EraseDeviceSecrets(void);

hal_status_t HAL_TAMP_EnableResourceProtection(uint32_t resources);
hal_status_t HAL_TAMP_DisableResourceProtection(uint32_t resources);
hal_tamp_protect_resources_status_t HAL_TAMP_IsEnabledResourceProtection(uint32_t resources);

hal_status_t HAL_TAMP_EnableHardwareBootkeyBlock(void);
hal_tamp_hardware_bootkey_status_t HAL_TAMP_IsEnabledHardwareBootkeyBlock(void);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif  /* __cplusplus */

#endif /* STM32U5XX_HAL_TAMP_H */
